
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ОбработкаДанныхВФоне(Параметры, АдресХранилищаРезультата) Экспорт
	
	Результат = Неопределено;
	
	ДлительныеОперации.СообщитьПрогресс(100, "Выполнено");
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилищаРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
